{
  "allman-information-om-dagen": {
    "title": "Allmän information on dagen",
    "speaker": null,
    "category": "info",
    "track": "forelasning",
    "slug": "allman-information-om-dagen",
    "description": "Allmän information om dagen, hålltider och annan relevant information."
  },
  "keynote": {
    "title": "Keynote",
    "description": "",
    "speaker": {
      "name": "Unn Swanström",
      "slug": "unn-swanstrom",
      "image": "assets/img/speaker_unn-swanstrom.jpeg"
    },
    "category": "lecture",
    "track": "forelasning",
    "slug": "keynote"
  },
  "sakerhet-i-en-devopskultur": {
    "title": "Säkerhet i en devops-kultur",
    "description": "Samtidigt som intresset för kontinuerliga leveranser ökar och de värden som omsätts i de system vi utvecklar blir större, utsätts systemen i ökande omfattning för attacker från individer och organisationer.\n\nSäkerhet upprätthålls traditionellt av en liten skara experter, men punktinsatser och granskningar cementerar ett vattenfalligt arbetssätt och avskräcker utvecklare från att intressera sig.\n\nHur kan vi bygga system med hög nivå av säkerhet samtidigt som vi håller värdeströmmen öppen genom täta releaser? Hur kan säkerhetsdisciplinen passa in i det lättrörliga teamet?\n\nMed denna presentation kommer jag att förslå tekniker och aktiviteter som hjälper det korsfunktionella teamet att bygga system som är robusta mot angrepp, definiera affärsnyttan i ett säkert system samt främja samarbetet med ett fristående säkerhetsteam.",
    "speaker": {
      "name": "Markus Örebrand",
      "slug": "markus-orebrand",
      "image": "assets/img/speaker_markus-orebrand.jpg"
    },
    "category": "lecture",
    "track": "forelasning",
    "slug": "sakerhet-i-en-devopskultur"
  },
  "den-nya-vagen-agila-organisationers-nasta-stora-utmaningar": {
    "title": "Den nya vägen: Agila organisationers nästa stora utmaningar!",
    "description": "De flesta organisationer och företag som utvecklar IT jobbar idag efter agila metoder för att öka effektiviteten och få bättre kvalitet. Det som samtidigt händer i många verksamheter är att kärnverksamheten och IT flyter ihop mer och mer då IT-system har blivit grundverktygen för att utföra det dagliga arbetet. Det här behöver vi som skapar IT-system förhålla oss till för att kunna skapa så stor nytta i verksamheten som möjligt och verkligen göra skillnad.",
    "speaker": {
      "name": "Peter Byström",
      "slug": "peter-bystrom",
      "image": "assets/img/speaker_peter-bystrom.png"
    },
    "category": "lecture",
    "track": "50_50",
    "slug": "den-nya-vagen-agila-organisationers-nasta-stora-utmaningar"
  },
  "testdriv-din-databas": {
    "title": "Testdriv din databas",
    "description": "Workshop där vi visar hur man testdriver fram databaskod i Java EE med hjälp av databasen H2. Implementationen består av två Repositorys, ett som använder JDBC och ett som använder JPA. Vi testdriver alltså både Java-klasserna och SQL/HQL.\n\nDeltagare bör ha eclipse eller motsvarande samt git, maven 3 och Java 8 installerat. Du bör också ha gjort följande:\n\n1. Laddat ner https://github.com/jonananas/tdd-the-database (git clone https://github.com/jonananas/tdd-the-database)\n2. Kört mvn clean install i projektet så att dependencies laddats ner.",
    "speaker": {
      "name": "Jonas Andersson",
      "slug": "jonas-andersson",
      "image": "assets/img/speaker_jonas-andersson.jpg"
    },
    "category": "workshop",
    "track": "workshop",
    "slug": "testdriv-din-databas",
    "requiresComputer": true
  },
  "ar-det-hogpresterande-teamet-en-utopi": {
    "title": "Är det högpresterande teamet en utopi?",
    "description": "Team:et är väldigt centralt i det agila tänket. Mycket ansvar läggs på teamet och det ställs en hel del krav på det. Teamet ska vara cross-funktionellt och ska tillsammans med produktägare leverera rätt system. Hur sätter vi då samman ett team som fungerar bra tillsammans, med produktägare och verksamhet samtidigt som det kan prestera på hög nivå? Vilka faktorer är det som spelar in? I den här presentationen tänkte jag gå igenom några av dessa faktorer och ge tips på hinder att se upp med.",
    "speaker": {
      "name": "Mattias Sällström",
      "slug": "mattias-sallstrom",
      "image": "assets/img/speaker_mattias-sallstrom.png"
    },
    "category": "lecture",
    "track": "forelasning",
    "slug": "ar-det-hogpresterande-teamet-en-utopi"
  },
  "agilt-har-sport-och-lagidtrott-nagot-att-tillfora": {
    "title": "Agilt – har sport och lagidrott något att tillföra?",
    "description": "Många IT-projekt som har använt sig av agil systemutveckling har skördat framgång de senaste åren. Agile är i sig inte en metod för systemutveckling utan handlar mer om en uppsättning värderingar, attityder och principer. Samarbete och de agila teamen spelar en central roll och är viktiga för att ett projekt ska kunna leverera fungerande programvara med hög kvalitet under lång tid. Inom sportens värld, och framför allt inom lagidrotter, har man sedan länge fokuserat just på att få team att samarbete och prestera maximalt. Vad finns det för likheter och olikheter mellan det agila arbetssättet och hur man jobbar inom lagidrotten? Finns det lärdomar från sportens värld som skulle kunna tillämpas på det agila arbetssättet? Inom idrottens värld använder man ofta även idrottspsykologi som ett hjälpmedel för att öka prestationen. Finns det tillfällen där idrottspsykologi skulle kunna förbättra det agila arbetssättet för IT-projekt?",
    "speaker": {
      "name": "Erik Adamsson",
      "slug": "erik-adamsson",
      "image": "assets/img/speaker_erik-adamsson.png"
    },
    "category": "lecture",
    "track": "50_50",
    "slug": "agilt-har-sport-och-lagidtrott-nagot-att-tillfora"
  },
  "open-space": {
    "title": "Open space",
    "speaker": null,
    "category": "discussion",
    "slug": "open-space"
  },
  "extreme-agile": {
    "title": "Extrem agil transparens",
    "description": "Extrem agil transparens - hur vi jobbar i gemensamma scrumteam mellan Sverige och Australien när vi bygger deras nya börs.",
    "speaker": {
      "name": "Alexander Sehlin",
      "slug": "alexander-sehlin",
      "image": "assets/img/speaker_alexander-sehlin.jpg"
    },
    "category": "lecture",
    "track": "forelasning",
    "slug": "extreme-agile"
  },
  "refactorisering-av-legacy-code": {
    "title": "Refactorisering av Legacy code",
    "description": "Hic Svnt Dracones!\n\nHur tämjs bestarna som lurar i koden? Hur fjättrars dessa i sina lyor så att vi åter igen kan ströva fritt över våra klasser? Sådana heroiska tekniker kommer vi att diskutera och öva på under denna workshop. Förhoppningsvis kommer du ett steg närmare att vara hjälten i ert team.\n\nVi kommer att använda java, men dessa tekniker är översättningsbara till t.ex. C# eller javascript.",
    "speaker": {
      "name": "Björn Palmqvist",
      "slug": "bjorn-palmqvist",
      "image": "assets/img/speaker_bjorn-palmqvist.jpeg"
    },
    "category": "workshop",
    "track": "50_50",
    "slug": "refactorisering-av-legacy-code",
    "requiresComputer": true
  },
  "tre-ovningar-for-agila-projekt": {
    "title": "Tre övningar för agila projekt",
    "description": "Prova på och lär dig tre övningar inom kommunikation, pågående arbete och självförbättrande team.",
    "speaker": {
      "name": "Peter Byström",
      "slug": "peter-bystrom",
      "image": "assets/img/speaker_peter-bystrom.png"
    },
    "category": "workshop",
    "track": "workshop",
    "slug": "tre-ovningar-for-agila-projekt"
  },
  "checklistor": {
    "title": "Implementera process med checklistor",
    "description": "Tusentals timmar läggs på att beskriva processer, men hur många timmar läggs på att följa dem? Hur ofta skjuter man upp aktiviteter som dokumentation till efter release, dvs till tidens ände? Vore det inte bättre att lägga färre timmar på processbeskrivningar, och fler timmar på att följa dem? Detta “prat” handlar om erfarenheter från ett uppdrag inom Skatteverkets IT i Umeå, om hur en enkel checklista kan främja processefterlevnad.",
    "speaker": {
      "name": "Christina Skaskiw",
      "slug": "christina-skaskiw",
      "image": "assets/img/speaker_christina-skaskiw.png"
    },
    "category": "lecture",
    "track": "forelasning",
    "slug": "checklistor"
  },
  "paneldiskussion": {
    "title": "Paneldiskussion",
    "description": "TBA",
    "speaker": null,
    "category": "discussion",
    "track": "forelasning",
    "slug": "paneldiskussion"
  },
  "avslutning": {
    "title": "Avslutning",
    "description": "Vi avslutar dagen med en kort summering av vad vi sett, samt övrig information som kan vara bra för er att känna till",
    "speaker": null,
    "category": "info",
    "track": "forelasning",
    "slug": "avslutning"
  }
}
